---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricSheetWrongHost
source: html/2e0e64f7-63c2-39df-010f-c8cfa776c707.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricFailures.FabricSheetWrongHost Property

Fabric Sheet can be placed only in Structural Floors and straight Structural Walls.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricSheetWrongHost { get; }
```